app/controllers/authcallbacks_controller.rb

  def create
    o = request.env['omniauth.auth'].deep_symbolize_keys
    Rails.logger.ap o

    begin

      identity = Identity.includes(:user).find_by_uid_and_context_name(o[:uid], o[:provider])
      user = identity.nil? ? nil : identity.user

      case

      # New User
      when (user.nil? and current_user.nil?)
        Rails.logger.info "New User"
        password = rand(10**10).to_s(36)
        user = User.create! :password => password
---
INSERT INTO "users" ("background_picture", "created_at", "name", "password_hash", "password_salt", "tagline", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def fail
    ap params
    error = "We could not connect to #{params["strategy"].capitalize}"
    Rails.logger.warn "WARNING OAUTH FAILED #{params}"
    if session[:user_id].nil?
      redirect_to  params["origin"] || :root , :notice => error
    else
      user = User.find( session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]