app/controllers/users_controller.rb

  def create
    @email = Email.new :email => params[:email]
    @user = User.new params[:user]
    if @user.save and @email.save
---
INSERT INTO "emails" ("created_at", "email", "md5_hash", "updated_at", "user_id", "verification_code") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
INSERT INTO "users" ("background_picture", "created_at", "name", "password_hash", "password_salt", "tagline", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"